Учет_кабельной_продукции/src/Enums/СтатусыЗаданийНаЗакупку/СтатусыЗаданийНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаданийНаЗакупку</name>
  <enumValues>
    <name>ВыданоПодрядчику</name>
  </enumValues>
  <enumValues>
    <name>НаДоработке</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыКабельныхЛиний/СтатусыКабельныхЛиний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКабельныхЛиний</name>
  <enumValues>
    <name>ЗаданиеНаЗакупкуНеВыдано</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЗакупкуКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ВЗакупке</name>
  </enumValues>
  <enumValues>
    <name>ВходнойКонтрольНеПройден</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКППНеРазрешён</name>
  </enumValues>
  <enumValues>
    <name>ЗаданиеНаЭМРКППВОформлении</name>
  </enumValues>
  <enumValues>
    <name>ЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПредъявлениеЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ЗамечанияКЭМРКПП</name>
  </enumValues>
  <enumValues>
    <name>ПодписаниеИКЖЧистовик</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
  <enumValues>
    <name>Заменён</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыЗаявкиНаЗакупку/СтатусыЗаявкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкиНаЗакупку</name>
  <enumValues>
    <name>ОжидаетЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ЗаключениеДоговора</name>
  </enumValues>
  <enumValues>
    <name>Изготовление</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Поставлено</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусаМонтажаКППНаОбъекте/СтатусаМонтажаКППНаОбъекте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусаМонтажаКППНаОбъекте</name>
  <enumValues>
    <name>ЗапросНаРасмотрении</name>
  </enumValues>
  <enumValues>
    <name>МонтажКППНеРазрешен</name>
  </enumValues>
  <enumValues>
    <name>МонтажКППРазрешен</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/CommonModules/СтатусыСервер/Module.bsl
Функция ПолучитьСтатусКабельнойЛинии(ТекущийСтатусОбъекта, ПометкаУдаления, СканДокументаПрикреплен = Ложь) Экспорт
	
	Если ПометкаУдаления Тогда  
		Статус = ПолучитьСтатусКабельнойЛинииПриПометкеНаУдаление(ТекущийСтатусОбъекта, СканДокументаПрикреплен);	  
	Иначе
		Статус = ПолучитьСтатусКабельнойЛинииПриЗаписи(ТекущийСтатусОбъекта, СканДокументаПрикреплен);	
	КонецЕсли;	
	
	Возврат Статус;
	
КонецФункции	
											 
Функция ПолучитьСтатусКабельнойЛинииПриЗаписи(ТекущийСтатусОбъекта, СканДокументаПрикреплен = Ложь)  

	СтатусКабельнойЛинии = Неопределено;
	Если ТекущийСтатусОбъекта = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику Тогда   
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуКППВОформлении;	     
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусыЗаданийНаЗакупку.Принято Тогда    
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВЗакупке;	 
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусыЗаявкиНаЗакупку.Поставлено Тогда    
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВходнойКонтрольНеПройден;	  
		Если СканДокументаПрикреплен Тогда
			СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;	  			
		КонецЕсли;
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.ЗапросНаРасмотрении Тогда

		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЭМРКППВОформлении;		
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.МонтажКППРазрешен Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКПП;
	ИначеЕсли ТекущийСтатусОбъекта = Перечисления.СтатусаМонтажаКППНаОбъекте.МонтажКППНеРазрешен Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;	  							
	КонецЕсли;	
	
	Возврат СтатусКабельнойЛинии;
	
КонецФункции

Функция ПолучитьСтатусКабельнойЛинииПриПометкеНаУдаление(ТекущийСтатусОбъекта, СканДокументаПрикреплен = Ложь)  

	СтатусКабельнойЛинии = Неопределено;
	Если ТекущийСтатусОбъекта = Перечисления.СтатусыЗаявкиНаЗакупку.Поставлено Тогда 
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ВЗакупке;  
	ИначеЕсли ТипЗнч(ТекущийСтатусОбъекта) = Тип("ПеречислениеСсылка.СтатусыЗаданийНаЗакупку") Тогда
		
		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЗаданиеНаЗакупкуНеВыдано;  
	ИначеЕсли ТипЗнч(ТекущийСтатусОбъекта) = Тип("ПеречислениеСсылка.СтатусаМонтажаКППНаОбъекте") Тогда

		СтатусКабельнойЛинии = Перечисления.СтатусыКабельныхЛиний.ЭМРКППНеРазрешён;  		
	КонецЕсли;	
	
	Возврат СтатусКабельнойЛинии;
	
КонецФункции
